In [2]:
#Pandas  powerful python data analysis toolkit
#it is built on top of numpy so it is very fast
#andas series  nand pandas  datafram

In [3]:
import pandas as pd

In [7]:
#To access series object

groceries = pd.Series(data=[30,6,'Yes','No'],index=['eggs','apples','milk','bread'])
print(groceries)

eggs       30
apples      6
milk      Yes
bread      No
dtype: object

In [10]:
groceries.shape

(4,)

In [11]:
groceries.ndim

1

In [12]:
groceries.size

4

In [13]:
groceries.values

array([30, 6, 'Yes', 'No'], dtype=object)

In [14]:
'banana' in groceries

False

In [15]:
'milk' in groceries

True

In [16]:
groceries['eggs']

30

In [19]:
groceries[['milk','bread']]

milk     Yes
bread     No
dtype: object

In [20]:
groceries[["milk","bread"]]

milk     Yes
bread     No
dtype: object

In [22]:
groceries[0]

30

In [24]:
groceries[[0,1]]

eggs      30
apples     6
dtype: object

In [26]:
groceries.loc[['eggs','apples']]

eggs      30
apples     6
dtype: object

In [27]:
groceries.iloc[[2,3]]

milk     Yes
bread     No
dtype: object

In [38]:
groceries

eggs       2
milk     Yes
bread     No
dtype: object

In [29]:
groceries['eggs']=2

In [30]:
groceries

eggs        2
apples      6
milk      Yes
bread      No
dtype: object

In [33]:
groceries.drop('apples')      # here only modified series have change not the oprignal

eggs       2
milk     Yes
bread     No
dtype: object

In [34]:
groceries                    # original series is as it is

eggs        2
apples      6
milk      Yes
bread      No
dtype: object

In [40]:
groceries.drop('apples',inplace=True)          #but we can change actual series also

In [41]:

print(groceries)

eggs      30
milk     Yes
bread     No
dtype: object

In [44]:
#Elementwise operation
fruits= pd.Series([10,6,3],["apples","banana","orange"])
fruits

apples    10
banana     6
orange     3
dtype: int64

In [45]:
fruits+2

apples    12
banana     8
orange     5
dtype: int64

In [46]:

fruits-2

apples    8
banana    4
orange    1
dtype: int64

In [47]:
fruits*3

apples    30
banana    18
orange     9
dtype: int64

In [48]:
fruits/3

apples    3.333333
banana    2.000000
orange    1.000000
dtype: float64

In [49]:
import numpy as np

In [50]:
fruits

apples    10
banana     6
orange     3
dtype: int64

In [51]:
np.sqrt(fruits)

apples    3.162278
banana    2.449490
orange    1.732051
dtype: float64

In [52]:
np.exp(fruits)

apples    22026.465795
banana      403.428793
orange       20.085537
dtype: float64

In [53]:
np.power(fruits,2)

apples    100
banana     36
orange      9
dtype: int64

In [54]:
np.power(fruits,3)

apples    1000
banana     216
orange      27
dtype: int64

In [55]:
fruits['banana']+2

8

In [56]:
fruits.iloc[0]-2

8

In [60]:
fruits

apples    10
banana     6
orange     3
dtype: int64

In [1]:
# the second main datastructure in pandas is dataset
#two dimentional object with level,row and column

import pandas as pd

In [2]:
import pandas as pd

In [5]:
items = {'Bob':pd.Series([245,25,55],index =['bike','pants','watch']),
        'Alice':pd.Series([40,110,500,45],index=['book','glasses','bike','pants'])}
type(items)

dict

In [19]:
shoping_carts =pd.DataFrame(items)   #here we ceated a pandas dataframe from a dictionary with clear index given
shoping_carts                        #here NAN defined no values is givenn

     Bob  Alice
0  245.0     40
1   25.0    110
2   55.0    500
3    NaN     45

In [14]:
data= {'Bob':pd.Series([245,25,55]),
        'Alice':pd.Series([40,110,500,45])}  # it is not indexed
df = pd.DataFrame(data)
df

     Bob  Alice
0  245.0     40
1   25.0    110
2   55.0    500
3    NaN     45

In [23]:
bob_shopping_cart = pd.DataFrame(items,columns=['Bob'])
bob_shopping_cart

   Bob
0  245
1   25
2   55

In [25]:
sel_shopping_cart = pd.DataFrame(items,index=['pants','book'])
sel_shopping_cart

       Bob  Alice
pants  NaN    NaN
book   NaN    NaN

In [29]:
data = {'Integers':[1,2,3],
       'Floates':[4.5,8.2,9.6]}
df =pd.DataFrame(data,index =["label1",'label2','label3'])
df

        Integers  Floates
label1         1      4.5
label2         2      8.2
label3         3      9.6

In [31]:
items =[{'bikes':20,'pants':30,'watches':35},{'watches':10,'glasses':50,'bikes':12,'pamt':5}]
store_items =pd.DataFrame(items,index=['store1','store2'])
store_items

        bikes  glasses  pamt  pants  watches
store1     20      NaN   NaN   30.0       35
store2     12     50.0   5.0    NaN       10

In [32]:
store_items[['bikes']]

        bikes
store1     20
store2     12

In [35]:
store_items[['pants','bikes']]

        pants  bikes
store1   30.0     20
store2    NaN     12

In [38]:
store_items.loc[['store1']]

        bikes  glasses  pamt  pants  watches
store1     20      NaN   NaN   30.0       35

In [41]:
store_items['bikes']['store2']   #column label first then row level provided

12

In [1]:
import pandas as pd

In [2]:
items =[{'bikes':20,'pants':30,'watches':35,'shirts':45,'watches':10},
        {'watches':10,'glasses':50,'bikes':15,'pants':5,'shirts':2,'shoes':5,'suits':7},
        {'watches':12,'glasses':45,'bikes':19,'pants':5,'shoes':15,'suits':17}]
store_items =pd.DataFrame(items,index=['store 1','store 2','store 3'])
store_items

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    45.0    NaN    NaN       10
store 2     15     50.0      5     2.0    5.0    7.0       10
store 3     19     45.0      5     NaN   15.0   17.0       12

In [3]:
#NaN not as number pandas detect NaN here we learn about the dealing with NaN

In [5]:
x = store_items.isnull()   #.sum().sum()
print(x)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1  False     True  False   False   True   True    False
store 2  False    False  False   False  False  False    False
store 3  False    False  False    True  False  False    False

In [6]:
x = store_items.isnull().sum().sum()   # here we the number of Nan values
print(x)

4

In [8]:
store_items.count()     # here we count non  NaN values

bikes      3
glasses    2
pants      3
shirts     2
shoes      2
suits      2
watches    3
dtype: int64

In [11]:
# NOW WE know no of NAN value then we have two option 
# 1.Remove--dropna() method  and (axis=0) for eliminate any row
# to column (axis=1)

store_items.dropna(axis=0)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 2     15     50.0      5     2.0    5.0    7.0       10

In [12]:
store_items.dropna(axis=1)

         bikes  pants  watches
store 1     20     30       10
store 2     15      5       10
store 3     19      5       12

In [14]:
#At the place of eleminating NaN values we can replace it with zero 0
store_items.fillna(0)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      0.0     30    45.0    0.0    0.0       10
store 2     15     50.0      5     2.0    5.0    7.0       10
store 3     19     45.0      5     0.0   15.0   17.0       12

In [16]:
# we can also fill  the values from previos filling
store_items.fillna(method ='ffill',axis=0)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    45.0    NaN    NaN       10
store 2     15     50.0      5     2.0    5.0    7.0       10
store 3     19     45.0      5     2.0   15.0   17.0       12

In [17]:
store_items

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    45.0    NaN    NaN       10
store 2     15     50.0      5     2.0    5.0    7.0       10
store 3     19     45.0      5     NaN   15.0   17.0       12

In [18]:
# we can also fill  the values from previos filling
store_items.fillna(method ='ffill',axis=0)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    45.0    NaN    NaN       10
store 2     15     50.0      5     2.0    5.0    7.0       10
store 3     19     45.0      5     2.0   15.0   17.0       12

In [20]:
#here all the NaN values replace with previous value in that rows
store_items.fillna(method ='ffill',axis=1)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1   20.0     20.0   30.0    45.0   45.0   45.0     10.0
store 2   15.0     50.0    5.0     2.0    5.0    7.0     10.0
store 3   19.0     45.0    5.0     5.0   15.0   17.0     12.0

In [21]:
#you can also replace by the next value using backfill() method
store_items.fillna(method ='backfill',axis=0)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20     50.0     30    45.0    5.0    7.0       10
store 2     15     50.0      5     2.0    5.0    7.0       10
store 3     19     45.0      5     NaN   15.0   17.0       12

In [22]:
store_items.fillna(method ='backfill',axis=1)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1   20.0     30.0   30.0    45.0   10.0   10.0     10.0
store 2   15.0     50.0    5.0     2.0    5.0    7.0     10.0
store 3   19.0     45.0    5.0    15.0   15.0   17.0     12.0

In [23]:
#to change the values to original dataframe you need to pass a third attribute as  inplace = True

In [25]:
#we also change NaN with different Interpolation methon
store_items.interpolate(method='linear',axis=0)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    45.0    NaN    NaN       10
store 2     15     50.0      5     2.0    5.0    7.0       10
store 3     19     45.0      5     2.0   15.0   17.0       12

In [26]:
store_items.interpolate(method='linear',axis=1)

         bikes  glasses  pants  shirts      shoes      suits  watches
store 1   20.0     25.0   30.0    45.0  33.333333  21.666667     10.0
store 2   15.0     50.0    5.0     2.0   5.000000   7.000000     10.0
store 3   19.0     45.0    5.0    10.0  15.000000  17.000000     12.0

#when working  with data use database and many sources

In [27]:
#pandas allowed us to load data in different formate
#most commonly use CSV -comma separated values

In [28]:
#we can load CSV data using read csv function

In [32]:
#this file taken from yahoo finanaces

#google_stock = pd.read_csv('./GOOG.csv')
#google_stock
##pandas automatically assign collomn  and  row and name assign as column 
#we can show head top 5 values using   google_stock.head()
#we  can show using last 5 rows of data  google_stock .tail()
#these both method take a value in integer 
#like  google_stock.head(10),google_stock .tail(21)

In [33]:
#we can also check the NaN vlaue using  isnul() method
#google_stock.isnull().any()

In [34]:
#if we dealing with large data we need statical imformation 
#pandas have discribe method to show statistical imformation

#google_stock.describe()

In [36]:
#you can also see single column  on e statistic

#many statistical method provided by pandas

#google_stock['Adj Close'].describe()
#google_stock .mean()
#google_stock.max()
#google_stock['Close'].min()  #this gives statical  min with specific column

#google_stock.corr()  it is used to co-relation betn the diff column

#google_stock.groupby() # it used to group data

In [40]:
small_wikipedia = pd.read_csv('./Downloads/smallwikipedia.csv')

In [41]:
small_wikipedia

                                User;Name;Date;changes
0         Category;Category;Date[dd/MM/yyyy HH:mm];int
1    194.210.1.51;Bonnet_phrygien;19/10/2004 11:02;163
2             Ske;Bonnet_phrygien;19/10/2004 12:11;751
3              Ske;Bonnet_phrygien;19/10/2004 12:12;17
4     83.27.202.42;Bonnet_phrygien;21/10/2004 10:39;42
5              Med;Bonnet_phrygien;29/10/2004 11:06;24
6    Martin.komunide.com;Ci-devant;09/11/2004 12:37;71
7                Aoineko;Ci-devant;10/11/2004 05:02;44
8       Sam Hocevar;Bonnet_phrygien;28/11/2004 02:42;4
9                   Cham;Ci-devant;15/12/2004 07:59;21
10       Sfrancois;Bonnet_phrygien;16/12/2004 11:26;35
11          Kelson;Bonnet_phrygien;25/12/2004 09:32;15
12         Durandal;Bonnet_phrygien;29/01/2005 07:36;4
13                 FoeNyx;Ci-devant;01/02/2005 11:05;6
14           Mued;Bonnet_phrygien;03/03/2005 03:49;243
15   ThierryVignaud;Bonnet_phrygien;15/04/2005 07:3...
16   Clm03;Alexandre_François_Marie_de_Beauharnais;...
17   Clm03;Alexandre_François_Marie_de_Beauharnais;...
18   Clm03;Alexandre_François_Marie_de_Beauharnais;...
19             Siren;Bien_national;23/04/2005 07:16;19
20           Siren;Bien_national;23/04/2005 08:12;1228
21                Jyp;Bien_national;23/04/2005 08:18;4
22   Clm03;Alexandre_François_Marie_de_Beauharnais;...
23    83.197.81.154;Citoyen_actif;16/05/2005 02:38;275
24     83.197.81.154;Citoyen_actif;16/05/2005 02:41;61
25   84.5.152.231;Camille_Borghèse;17/05/2005 01:07;72
26       Ploum's;Camille_Borghèse;17/05/2005 06:33;132
27   (et)t;Alexandre_François_Marie_de_Beauharnais;...
28       Aboumael;Camille_Borghèse;10/06/2005 01:26;61
29       Aboumael;Camille_Borghèse;10/06/2005 01:26;29
..                                                 ...
969  343KKT Kintaro;Bonnet_phrygien;04/07/2008 09:19;4
970  Sebleouf;Charles_Antoine_Chasset;04/07/2008 09...
971     Thijs!bot;Camille_Borghèse;05/07/2008 12:01;41
972  Jaucourt;Adoption_par_Louis_XVI_de_la_cocarde_...
973  Épiméthée;11e_régiment_de_hussards_(France);07...
974        Ir4ubot;Armée_de_l'Ouest;08/07/2008 09:01;5
975      Dinkley;Cocarde_tricolore;08/07/2008 11:31;77
976  Épiméthée;11e_régiment_de_hussards_(France);09...
977  Épiméthée;11e_régiment_de_hussards_(France);09...
978     Dinkley;Cocarde_tricolore;10/07/2008 06:31;101
979       Dinkley;Cocarde_tricolore;10/07/2008 06:31;1
980      Sanao;Cocarde_tricolore;10/07/2008 07:54;1613
981  Ir4ubot;Complot_révolutionnaire_nantais_contre...
982  Ir4ubot;Conspiration_de_Bicêtre;10/07/2008 08:...
983  89.3.211.202;Antoine_Banassat;12/07/2008 01:14;37
984  Ga-massoni;12e_régiment_de_hussards;13/07/2008...
985  Ga-massoni;12e_régiment_de_hussards;13/07/2008...
986  Ga-massoni;12e_régiment_de_hussards;13/07/2008...
987  Ga-massoni;12e_régiment_de_hussards;13/07/2008...
988  Ga-massoni;12e_régiment_de_hussards;13/07/2008...
989  Ga-massoni;12e_régiment_de_hussards;13/07/2008...
990         Lykos;Antoine_Banassat;13/07/2008 08:07;30
991  80.12.121.197;12e_régiment_de_hussards;14/07/2...
992      GillesC;Cocarde_tricolore;18/07/2008 04:35;24
993  MelancholieBot;Bonnet_phrygien;19/07/2008 07:4...
994  Jotun;Coup_d'État_du_18_fructidor_an_V;19/07/2...
995  90.22.102.140;Corps_législatif_(Consulat_et_Pr...
996    Dinkley;Cocarde_tricolore;23/07/2008 08:19;2238
997      Dinkley;Cocarde_tricolore;23/07/2008 08:25;39
998  Dinkley;Adoption_par_Louis_XVI_de_la_cocarde_t...

[999 rows x 1 columns]

In [43]:
small_wikipedia.head()

                              User;Name;Date;changes
0       Category;Category;Date[dd/MM/yyyy HH:mm];int
1  194.210.1.51;Bonnet_phrygien;19/10/2004 11:02;163
2           Ske;Bonnet_phrygien;19/10/2004 12:11;751
3            Ske;Bonnet_phrygien;19/10/2004 12:12;17
4   83.27.202.42;Bonnet_phrygien;21/10/2004 10:39;42

In [44]:
small_wikipedia.tail()

                                User;Name;Date;changes
994  Jotun;Coup_d'État_du_18_fructidor_an_V;19/07/2...
995  90.22.102.140;Corps_législatif_(Consulat_et_Pr...
996    Dinkley;Cocarde_tricolore;23/07/2008 08:19;2238
997      Dinkley;Cocarde_tricolore;23/07/2008 08:25;39
998  Dinkley;Adoption_par_Louis_XVI_de_la_cocarde_t...

In [45]:
small_wikipedia.head(10)

                              User;Name;Date;changes
0       Category;Category;Date[dd/MM/yyyy HH:mm];int
1  194.210.1.51;Bonnet_phrygien;19/10/2004 11:02;163
2           Ske;Bonnet_phrygien;19/10/2004 12:11;751
3            Ske;Bonnet_phrygien;19/10/2004 12:12;17
4   83.27.202.42;Bonnet_phrygien;21/10/2004 10:39;42
5            Med;Bonnet_phrygien;29/10/2004 11:06;24
6  Martin.komunide.com;Ci-devant;09/11/2004 12:37;71
7              Aoineko;Ci-devant;10/11/2004 05:02;44
8     Sam Hocevar;Bonnet_phrygien;28/11/2004 02:42;4
9                 Cham;Ci-devant;15/12/2004 07:59;21

In [46]:
small_wikipedia.tail()

                                User;Name;Date;changes
994  Jotun;Coup_d'État_du_18_fructidor_an_V;19/07/2...
995  90.22.102.140;Corps_législatif_(Consulat_et_Pr...
996    Dinkley;Cocarde_tricolore;23/07/2008 08:19;2238
997      Dinkley;Cocarde_tricolore;23/07/2008 08:25;39
998  Dinkley;Adoption_par_Louis_XVI_de_la_cocarde_t...

In [51]:
factbook = pd.read_csv('./Downloads/factbook.csv')

In [52]:
factbook

    Country;Area(sq km);Birth rate(births/1000 population);Current account balance;Death rate(deaths/1000 population);Debt - external;Electricity - consumption(kWh);Electricity - production(kWh);Exports;GDP;GDP - per capita;GDP - real growth rate(%);HIV/AIDS - adult prevalence rate(%);HIV/AIDS - deaths;HIV/AIDS - people living with HIV/AIDS;Highways(km);Imports;Industrial production growth rate(%);Infant mortality rate(deaths/1000 live births);Inflation rate (consumer prices)(%);Internet hosts;Internet users;Investment (gross fixed)(% of GDP);Labor force;Life expectancy at birth(years);Military expenditures - dollar figure;Military expenditures - percent of GDP(%);Natural gas - consumption(cu m);Natural gas - exports(cu m);Natural gas - imports(cu m);Natural gas - production(cu m);Natural gas - proved reserves(cu m);Oil - consumption(bbl/day);Oil - exports(bbl/day);Oil - imports(bbl/day);Oil - production(bbl/day);Oil - proved reserves(bbl);Population;Public debt(% of GDP);Railways(km);Reserves of foreign exchange & gold;Telephones - main lines in use;Telephones - mobile cellular;Total fertility rate(children born/woman);Unemployment rate(%)
0    String;double;double;double;double;double;doub...
1    Afghanistan;647500;47.02;;20.75;8000000000;652...
2    Akrotiri;123;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;...
3    Albania;28748;15.08;-504000000;5.12;1410000000...
4    Algeria;2381740;17.13;11900000000;4.60;2190000...
5    American Samoa;199;23.13;;3.33;;120900000;1300...
6    Andorra;468;9.00;;6.07;;;;58000000;1900000000;...
7    Angola;1246700;44.64;-37880000;25.90;104500000...
8    Anguilla;102;14.26;;5.43;8800000;42600000;;260...
9    Antarctica;14000000;;;;;;;;;;;;;;;;;;;;;;;;;;;...
10   Antigua and Barbuda;443;17.26;;5.44;231000000;...
11   Argentina;2766890;16.90;5473000000;7.56;157700...
12   Armenia;29800;11.76;-240400000;8.16;905000000;...
13   Aruba;193;11.26;;6.57;285000000;751200000;8077...
14   Ashmore and Cartier Islands;5;;;;;;;;;;;;;;;;;...
15   Australia;7686850;12.26;-38300000000;7.44;3087...
16   Austria;83870;8.81;-3283000000;9.70;1550000000...
17   Azerbaijan;86600;20.40;-2899000000;9.86;183200...
18   Bahamas The;13940;17.87;;8.97;308500000;159600...
19   Bahrain;665;18.10;586100000;4.08;6215000000;63...
20   Baker Island;1;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;...
21   Bangladesh;144000;30.01;216600000;8.40;1997000...
22   Barbados;431;12.83;;9.17;668000000;744000000;8...
23   Bassas da India;0;;;;;;;;;;;;;;;;;;;;;;;;;;;;;...
24   Belarus;207600;10.83;-1119000000;14.15;6000000...
25   Belgium;30528;10.48;11400000000;10.22;28300000...
26   Belize;22966;29.34;-115000000;6.04;1362000000;...
27   Benin;112620;41.99;-159900000;13.76;1600000000...
28   Bermuda;53;11.60;;7.63;160000000;598000000;643...
29   Bhutan;47000;34.03;;12.94;245000000;312900000;...
..                                                 ...
234  Tanzania;945087;38.16;-327400000;16.71;7321000...
235  Thailand;514000;15.70;6736000000;7.02;50590000...
236  Togo;56785;33.48;-125600000;11.80;1400000000;4...
237  Tokelau;10;;;;0;;;98000;1500000;1000;;;;;;3230...
238  Tonga;748;25.18;;5.35;63400000;23060000;247900...
239  Trinidad and Tobago;5128;12.81;1548000000;9.37...
240  Tromelin Island;1;;;;;;;;;;;;;;;;;;;;;;;;;;;;;...
241  Tunisia;163610;15.50;71850000;5.09;14710000000...
242  Turkey;780580;16.83;-15300000000;5.96;16900000...
243  Turkmenistan;488100;27.68;114000000;8.78;24000...
244  Turks and Caicos Islands;430;22.23;;4.28;;4650...
245  Tuvalu;26;21.91;;7.22;;;;1000000;12200000;1100...
246  Uganda;236040;47.39;-590800000;12.80;386500000...
247  Ukraine;603700;10.49;4584000000;16.42;16370000...
248  United Arab Emirates;82880;18.78;6300000000;4....
249  United Kingdom;244820;10.78;-33460000000;10.18...
250  United States;9631418;14.14;-646500000000;8.25...
251  Uruguay;176220;14.09;181800000;9.06;1280000000...
252  Uzbekistan;447400;26.22;461900000;7.95;4351000...
253  Vanuatu;12200;23.06;;7.90;83700000;45030000;48...
254  Venezuela;912050;18.91;14590000000;4.90;332900...
255  Vietnam;329560;17.07;-2061000000;6.20;16550000...
256  Virgin Islands;352;14.20;;6.26;;962600000;1035...
257  Wake Island;7;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;...
258  Wallis and Futuna;274;;;;;;;250000;60000000;38...
259  West Bank;5860;32.37;;3.99;108000000;;;2050000...
260  Western Sahara;266000;;;;;83700000;90000000;;;...
261  Yemen;527970;43.07;369900000;8.53;5400000000;2...
262  Zambia;752614;41.38;-181400000;20.23;535300000...
263  Zimbabwe;390580;29.74;-230300000;24.66;4086000...

[264 rows x 1 columns]